export const ARANE_RIVER_WEEKLY_QUEST_REGIONS: AraneRiverWeeklyQuestRegion[] = [
  '소멸의여로',
  '츄츄아일랜드',
  '레헬른',
  '아르카나',
  '모라스',
  '에스페라',
];

export const ARANE_RIVER_WEEKLY_QUEST_EXP: RegionLevelMap<AraneRiverWeeklyQuestRegion> =
  {
    소멸의여로: 187726220,
    츄츄아일랜드: 549143140,
    레헬른: 817717500,
    아르카나: 847484010,
    모라스: 1127760555,
    에스페라: 1161754860,
  };

export const ARANE_RIVER_WEEKLY_QUEST_MIN_REGIONS_LEVEL: RegionLevelMap<AraneRiverWeeklyQuestRegion> =
  {
    소멸의여로: 200,
    츄츄아일랜드: 210,
    레헬른: 220,
    아르카나: 225,
    모라스: 230,
    에스페라: 235,
  };

export const ARANE_RIVER_WEEKLY_QUEST_NAME = {
  소멸의여로: '에르다 스펙트럼',
  츄츄아일랜드: '배고픈 무토',
  레헬른: '미드나잇 체이서',
  아르카나: '스피릿 세이비어',
  모라스: '엔하임 디펜스',
  에스페라: '프로텍트 에스페라',
};

export const EPIC_DUNGEON_REGIONS: EpicDungeonRegion[] = [
  '하이마운틴',
  '앵글러컴퍼니',
];

export const EPIC_DUNGEON_MIN_REGIONS_LEVEL: RegionLevelMap<EpicDungeonRegion> =
  {
    하이마운틴: 260,
    앵글러컴퍼니: 270,
  };

export const EPIC_DUNGEON_EXP: RequiredLevelExp = {
  260: 194600000000,
  261: 197400000000,
  262: 200200000000,
  263: 203000000000,
  264: 206200000000,
  265: 232000000000,
  266: 235200000000,
  267: 238400000000,
  268: 242000000000,
  269: 245200000000,
  270: 256500000000,
  271: 268700000000,
  272: 272100000000,
  273: 287100000000,
  274: 291300000000,
  275: 327400000000,
  276: 331500000000,
  277: 336200000000,
  278: 340300000000,
  279: 345000000000,
  280: 387500000000,
  281: 392800000000,
  282: 397500000000,
  283: 402800000000,
  284: 407600000000,
  285: 458200000000,
  286: 463500000000,
  287: 469600000000,
  288: 475600000000,
  289: 481000000000,
  290: 481000000000,
  291: 481000000000,
  292: 481000000000,
  293: 481000000000,
  294: 481000000000,
  295: 481000000000,
  296: 481000000000,
  297: 481000000000,
  298: 481000000000,
  299: 481000000000,
};
