export const historyList: HistoryItem[] = [
  {
    id: 11,
    date: '2024.10.17',
    category: [
      {
        title: '<메할일 - 아즈모스 협곡> 보상 변경 (10/31 변경완료)',
        list: [
          '아즈모스에서 획득 보상이 기존의 절반으로 조정됩니다.',
        ],
      },
      {
        title: '<메할일 - 아즈모스 협곡> 기능 업데이트',
        list: [
          '신규 주간 퀘스트 "아즈모스 협곡" 콘텐츠 정보를 제공합니다.',
          '추가된 콘텐츠는 실제 획득 경험치와 약간의 오차가 있을 수 있습니다.',
        ],
      },
      {
        title: '<메할일 - EXP 교환권> 기능 업데이트',
        list: [
          'EXP 교환권 경험치 계산 정보를 제공합니다. (이벤트 기간: 24.10.17 ~ 24.12.18)',
          '추가된 콘텐츠는 실제 획득 경험치와 약간의 오차가 있을 수 있습니다.',
        ],
      },
      {
        title: '<메할일 - 잠수맵> 변경 안내',
        list: [
          '기존 "견습 로봇 놀이터(잠수맵)"가 "VIP 사우나(잠수맵)"로 변경됩니다. (이벤트 기간: 24.10.17 ~ 24.12.18)',
          '기존과 동일한 경험치 효과를 가집니다.',
          '변경된 콘텐츠는 실제 획득 경험치와 약간의 오차가 있을 수 있습니다.',
        ],
      },
      {
        title: '신규 경험치 도핑 아이템 "아즈모스 영약" 추가',
        list: [
          '"아즈모스 영약" 아이템이 추가되었습니다. 프리셋에도 추가 등록이 가능합니다.',
        ],
      },
      {
        title:
          '새로운 이벤트 버프 스킬 "차원 너머의 힘" 정보를 가져옵니다.(10/21 업데이트 완료)',
        list: [],
      },
      {
        title: '오류 수정',
        list: [
          '"메할일" 총합 획득 경험치가 올바르게 적용되지 않는 문제가 해결됬습니다. (10/23 수정 완료)',
          '카르시온 - "어둠이 내리는 나무줄기 2" 지역의 몬스터 이름이 수정됩니다.',
        ],
      },
    ],
  },
  {
    id: 10,
    date: '2024.09.17',
    category: [
      {
        title: '버닝필드 웹사이트 리뉴얼 및 기능 추가',
        list: [
          '사이트 전반의 디자인이 새롭게 변경되었습니다.',
          '프리미엄 PC방 선택 시, 경험치 획득량과 아이템 드롭률이 모두 적용됩니다.',
          '탈라하트 심볼 선택 시, 경험치 획득량, 아이템 드롭률, 메소 획득량이 모두 적용됩니다.',
        ],
      },
      {
        title: '신규 콘텐츠 <메할일> 업데이트',
        list: [
          '캐릭터 정보를 바탕으로 메할일(일퀘, 주간퀘, 몬스터파크, 에픽던전 등)의 경험치 획득량을 확인할 수 있습니다.',
          '경험치 획득 효율을 분석하여 최적의 메할일을 추천합니다.',
          '실제 획득 경험치와 약간의 차이가 발생할 수 있습니다.',
        ],
      },
      {
        title: '신규 사냥터 <탈라하트 지역> 업데이트',
        list: [
          '290레벨 지역인 탈라하트 지역이 추가되었습니다. 290레벨 이상의 캐릭터는 기본적으로 이 지역으로 설정됩니다.',
          '신규 그랜드 어센틱 심볼 : 탈라하트가 추가되어 경험치 획득량, 아이템 드롭률, 메소 획득량의 정보를 제공합니다.',
        ],
      },
      {
        title: '오류 수정',
        list: [
          '프리셋 기능의 오류가 수정되었습니다. 저장 버튼 클릭 시, 프리셋이 정상적으로 저장됩니다.',
          '캐릭터의 경험치 어빌리티 정보가 올바르게 표시되도록 수정됩니다.(9/20 22:19 수정완료)',
          '직접 입력 페이지에서 선택한 정보가 사라지는 오류가 수정됩니다.(9/23 00:32 수정완료)',
        ],
      },
    ],
  },
  {
    id: 9,
    date: '2024.08.13',
    category: [
      {
        title: '새로운 이벤트 버프 스킬(고브의 선물) 정보를 가져옵니다.',
        list: [
          '해당 정보를 통해 자동적으로 이벤트 버프 스킬의 경험치 증가 레벨이 설정됩니다.',
          '해당 정보를 통해 폴로 & 프리토의 메디사의 축복 레벨이 설정됩니다.',
        ],
      },
      {
        title: '프리미엄 PC방 경험치 획득량이 기존 80%에서 30%로 감소됩니다.',
        list: [
          '프리셋을 사용 중인 경우, 변경된 정보를 반영하기 위해 프리셋을 다시 선택해야 합니다.',
        ],
      },
      {
        title: '사냥터 정렬기능이 추가됩니다.',
        list: [],
      },
    ],
  },
  {
    id: 8,
    date: '2024.07.25',
    category: [
      {
        title: '이벤트 버프 스킬 정보를 가져옵니다.',
        list: [
          '해당 정보를 통해 자동적으로 이벤트 버프 스킬의 경험치 증가 레벨이 설정됩니다.',
          '해당 정보를 통해 폴로 & 프리토의 메디사의 축복 레벨이 설정됩니다.',
        ],
      },
    ],
  },
  {
    id: 7,
    date: '2024.07.18',
    category: [
      {
        title: '프리셋 기능이 추가됩니다.',
        list: [
          '프리셋 기능을 통해 API로 가져오지 못하는 정보를 제공합니다.',
          '재획비의 경우 아이템 드롭률과 메소 획득량 모두 적용됩니다.',
        ],
      },
      {
        title: '이벤트 스킬 변경(반레온의 검술 - 정예 기사)',
        list: [
          '이벤트 기간: 2024년 8월 12일 (수) 오후 11시 59분까지',
          '기존 신입 기사의 경험치는 필드 몬스터 대비 135배, 정예 기사의 경험치는 160배입니다.',
        ],
      },
    ],
  },
  {
    id: 6,
    date: '2024.07.11',
    category: [
      {
        title:
          '메디사의 축복(이벤트 폴로/프리토 추가 경험치 획득)이 추가됩니다.',
        list: [
          '폴로(성벽 지키기, 현상금 사냥, 스톰윙, 에스페시아)의 경우 합연산으로 계산됩니다.',
          '프리토(드래곤의 알, 구애의 춤, 독수리 사냥, 불꽃늑대)의 경우 곱연산으로 계산됩니다.',
        ],
      },
      {
        title: '오류 수정',
        list: [
          '유니온 아티팩트에서 아이템 드롭률을 가져오지 못하는 현상이 수정됩니다.',
        ],
      },
    ],
  },
  {
    id: 5,
    date: '2024.07.06',
    category: [
      {
        title: '특정 직업 검색 시 스킬 정보를 가져옵니다.',
        list: [
          '비숍의 경우 홀리 심볼 스킬 정보를 가져옵니다.',
          '나이트로드의 경우 쇼다운 챌린지 스킬 정보를 가져옵니다.',
          '섀도어의 경우 그리드 스킬 정보를 가져옵니다.',
          '5차 스킬인 로디스 다이스를 사용할 수 있는 직업(해적)은 해당 스킬 정보를 가져옵니다.',
        ],
      },
    ],
  },
  {
    id: 4,
    date: '2024.07.01',
    category: [
      {
        title: '오류 수정',
        list: [
          '캐릭터 이름 검색 시 글자 수 제한에 걸리는 문제가 수정됩니다.',
          '캐릭터가 칭호를 착용하지 않으면 검색되지 않는 문제가 수정됩니다.',
        ],
      },
    ],
  },
  {
    id: 3,
    date: '2024.06.23',
    category: [
      {
        title: '마릿수 계산에서 총합메소를 확인 가능합니다.',
        list: [],
      },
      {
        title: '오류 수정',
        list: [
          '270 레벨 이상에서 경험치 수치가 잘못 적용된 문제가 수정됩니다.',
          'PC방 경험치 80% 증가가 적용되지 않는 문제가 수정됩니다.',
        ],
      },
    ],
  },
  {
    id: 2,
    date: '2024.06.20',
    category: [
      {
        title: '이벤트 스킬 변경(반레온의 검술 - 신입기사)',
        list: ['이벤트 기간(2024년 7월 17일 (수) 오후 11시 59분까지)'],
      },
    ],
  },
  {
    id: 1,
    date: '2024.06.19',
    category: [
      {
        title: '버닝필드 - 메이플스토리 사냥터 효율 계산 서비스 시작',
        list: [
          '원하는 사냥터의 정보를 획득할 수 있습니다.',
          '폴로, 프리토의 경험치 정보를 알 수 있습니다.',
          'VIP 부스터 효율을 계산할 수 있습니다.',
          '사냥터 이벤트 스킬의 효율을 계산할 수 있습니다.',
        ],
      },
    ],
  },
];
